[Killed] BlockStatement
src/database/cache.js:3:41
 'use strict';
 
-module.exports.create = function (name) {
-    const cacheCreate = require('../cache/lru');
-    return cacheCreate({
-        name: `${name}-object`,
-        max: 40000,
-        ttl: 0,
-    });
-};
+module.exports.create = function (name) {};
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/database/cache.js:5:24
 
 module.exports.create = function (name) {
     const cacheCreate = require('../cache/lru');
-    return cacheCreate({
-        name: `${name}-object`,
-        max: 40000,
-        ttl: 0,
-    });
+    return cacheCreate({});
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/cache.js:6:15
 module.exports.create = function (name) {
     const cacheCreate = require('../cache/lru');
     return cacheCreate({
-        name: `${name}-object`,
+        name: ``,
         max: 40000,
         ttl: 0,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
