[Killed] BlockStatement
src/database/helpers.js:5:62
 
 const helpers = module.exports;
 
-helpers.mergeBatch = function (batchData, start, stop, sort) {
-    function getFirst() {
-        let selectedArray = batchData[0];
-        for (let i = 1; i < batchData.length; i++) {
-            if (batchData[i].length && (
-                !selectedArray.length ||
-                (sort === 1 && batchData[i][0].score < selectedArray[0].score) ||
-                (sort === -1 && batchData[i][0].score > selectedArray[0].score)
-            )) {
-                selectedArray = batchData[i];
-            }
-        }
-        return selectedArray.length ? selectedArray.shift() : null;
-    }
-    let item = null;
-    const result = [];
-    do {
-        item = getFirst(batchData);
-        if (item) {
-            result.push(item);
-        }
-    } while (item && (result.length < (stop - start + 1) || stop === -1));
-    return result;
-};
+helpers.mergeBatch = function (batchData, start, stop, sort) {};
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/helpers.js:6:25
 const helpers = module.exports;
 
 helpers.mergeBatch = function (batchData, start, stop, sort) {
-    function getFirst() {
-        let selectedArray = batchData[0];
-        for (let i = 1; i < batchData.length; i++) {
-            if (batchData[i].length && (
-                !selectedArray.length ||
-                (sort === 1 && batchData[i][0].score < selectedArray[0].score) ||
-                (sort === -1 && batchData[i][0].score > selectedArray[0].score)
-            )) {
-                selectedArray = batchData[i];
-            }
-        }
-        return selectedArray.length ? selectedArray.shift() : null;
-    }
+    function getFirst() {}
     let item = null;
     const result = [];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/database/helpers.js:8:25
 helpers.mergeBatch = function (batchData, start, stop, sort) {
     function getFirst() {
         let selectedArray = batchData[0];
-        for (let i = 1; i < batchData.length; i++) {
+        for (let i = 1; i >= batchData.length; i++) {
             if (batchData[i].length && (
                 !selectedArray.length ||
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/helpers.js:8:25
 helpers.mergeBatch = function (batchData, start, stop, sort) {
     function getFirst() {
         let selectedArray = batchData[0];
-        for (let i = 1; i < batchData.length; i++) {
+        for (let i = 1; false; i++) {
             if (batchData[i].length && (
                 !selectedArray.length ||
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/helpers.js:9:17
     function getFirst() {
         let selectedArray = batchData[0];
         for (let i = 1; i < batchData.length; i++) {
-            if (batchData[i].length && (
-                !selectedArray.length ||
-                (sort === 1 && batchData[i][0].score < selectedArray[0].score) ||
-                (sort === -1 && batchData[i][0].score > selectedArray[0].score)
-            )) {
+            if (false) {
                 selectedArray = batchData[i];
             }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/helpers.js:9:17
     function getFirst() {
         let selectedArray = batchData[0];
         for (let i = 1; i < batchData.length; i++) {
-            if (batchData[i].length && (
-                !selectedArray.length ||
-                (sort === 1 && batchData[i][0].score < selectedArray[0].score) ||
-                (sort === -1 && batchData[i][0].score > selectedArray[0].score)
-            )) {
+            if (true) {
                 selectedArray = batchData[i];
             }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/helpers.js:10:17
         let selectedArray = batchData[0];
         for (let i = 1; i < batchData.length; i++) {
             if (batchData[i].length && (
-                !selectedArray.length ||
-                (sort === 1 && batchData[i][0].score < selectedArray[0].score) ||
+                !selectedArray.length && sort === 1 && batchData[i][0].score < selectedArray[0].score ||
                 (sort === -1 && batchData[i][0].score > selectedArray[0].score)
             )) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/helpers.js:10:17
         let selectedArray = batchData[0];
         for (let i = 1; i < batchData.length; i++) {
             if (batchData[i].length && (
-                !selectedArray.length ||
-                (sort === 1 && batchData[i][0].score < selectedArray[0].score) ||
-                (sort === -1 && batchData[i][0].score > selectedArray[0].score)
+                (!selectedArray.length || sort === 1 && batchData[i][0].score < selectedArray[0].score) && sort === -1 && batchData[i][0].score > selectedArray[0].score
             )) {
                 selectedArray = batchData[i];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] LogicalOperator
src/database/helpers.js:11:18
         for (let i = 1; i < batchData.length; i++) {
             if (batchData[i].length && (
                 !selectedArray.length ||
-                (sort === 1 && batchData[i][0].score < selectedArray[0].score) ||
+                (sort === 1 || batchData[i][0].score < selectedArray[0].score) ||
                 (sort === -1 && batchData[i][0].score > selectedArray[0].score)
             )) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/helpers.js:11:32
         for (let i = 1; i < batchData.length; i++) {
             if (batchData[i].length && (
                 !selectedArray.length ||
-                (sort === 1 && batchData[i][0].score < selectedArray[0].score) ||
+                (sort === 1 && true) ||
                 (sort === -1 && batchData[i][0].score > selectedArray[0].score)
             )) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/helpers.js:12:18
             if (batchData[i].length && (
                 !selectedArray.length ||
                 (sort === 1 && batchData[i][0].score < selectedArray[0].score) ||
-                (sort === -1 && batchData[i][0].score > selectedArray[0].score)
+                (sort === -1 || batchData[i][0].score > selectedArray[0].score)
             )) {
                 selectedArray = batchData[i];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/helpers.js:12:18
             if (batchData[i].length && (
                 !selectedArray.length ||
                 (sort === 1 && batchData[i][0].score < selectedArray[0].score) ||
-                (sort === -1 && batchData[i][0].score > selectedArray[0].score)
+                (false)
             )) {
                 selectedArray = batchData[i];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/helpers.js:13:16
                 !selectedArray.length ||
                 (sort === 1 && batchData[i][0].score < selectedArray[0].score) ||
                 (sort === -1 && batchData[i][0].score > selectedArray[0].score)
-            )) {
-                selectedArray = batchData[i];
-            }
+            )) {}
         }
         return selectedArray.length ? selectedArray.shift() : null;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/helpers.js:21:8
     }
     let item = null;
     const result = [];
-    do {
-        item = getFirst(batchData);
-        if (item) {
-            result.push(item);
-        }
-    } while (item && (result.length < (stop - start + 1) || stop === -1));
+    do {} while (item && (result.length < (stop - start + 1) || stop === -1));
     return result;
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/helpers.js:23:13
     const result = [];
     do {
         item = getFirst(batchData);
-        if (item) {
+        if (false) {
             result.push(item);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/helpers.js:23:13
     const result = [];
     do {
         item = getFirst(batchData);
-        if (item) {
+        if (true) {
             result.push(item);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] LogicalOperator
src/database/helpers.js:26:23
         if (item) {
             result.push(item);
         }
-    } while (item && (result.length < (stop - start + 1) || stop === -1));
+    } while (item && (result.length < stop - start + 1 && stop === -1));
     return result;
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] UnaryOperator
src/database/helpers.js:26:70
         if (item) {
             result.push(item);
         }
-    } while (item && (result.length < (stop - start + 1) || stop === -1));
+    } while (item && (result.length < (stop - start + 1) || stop === +1));
     return result;
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
