[Survived] StringLiteral
src/database/index.js:5:32
 
 const nconf = require('nconf');
 
-const databaseName = nconf.get('database');
+const databaseName = nconf.get("");
 const winston = require('winston');
 

[Killed] ConditionalExpression
src/database/index.js:8:5
 const databaseName = nconf.get('database');
 const winston = require('winston');
 
-if (!databaseName) {
+if (false) {
     winston.error(new Error('Database type not set! Run ./nodebb setup'));
     process.exit();
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/index.js:8:20
 const databaseName = nconf.get('database');
 const winston = require('winston');
 
-if (!databaseName) {
-    winston.error(new Error('Database type not set! Run ./nodebb setup'));
-    process.exit();
-}
+if (!databaseName) {}
 
 const primaryDB = require(`./${databaseName}`);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/index.js:9:29
 const winston = require('winston');
 
 if (!databaseName) {
-    winston.error(new Error('Database type not set! Run ./nodebb setup'));
+    winston.error(new Error(""));
     process.exit();
 }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/index.js:15:72
 
 const primaryDB = require(`./${databaseName}`);
 
-primaryDB.parseIntFields = function (data, intFields, requestedFields) {
-    intFields.forEach((field) => {
-        if (!requestedFields || !requestedFields.length || requestedFields.includes(field)) {
-            data[field] = parseInt(data[field], 10) || 0;
-        }
-    });
-};
+primaryDB.parseIntFields = function (data, intFields, requestedFields) {};
 
 primaryDB.initSessionStore = async function () {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/index.js:16:34
 const primaryDB = require(`./${databaseName}`);
 
 primaryDB.parseIntFields = function (data, intFields, requestedFields) {
-    intFields.forEach((field) => {
-        if (!requestedFields || !requestedFields.length || requestedFields.includes(field)) {
-            data[field] = parseInt(data[field], 10) || 0;
-        }
-    });
+    intFields.forEach((field) => {});
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] LogicalOperator
src/database/index.js:17:13
 
 primaryDB.parseIntFields = function (data, intFields, requestedFields) {
     intFields.forEach((field) => {
-        if (!requestedFields || !requestedFields.length || requestedFields.includes(field)) {
+        if ((!requestedFields || !requestedFields.length) && requestedFields.includes(field)) {
             data[field] = parseInt(data[field], 10) || 0;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/index.js:17:13
 
 primaryDB.parseIntFields = function (data, intFields, requestedFields) {
     intFields.forEach((field) => {
-        if (!requestedFields || !requestedFields.length || requestedFields.includes(field)) {
+        if (requestedFields || !requestedFields.length || requestedFields.includes(field)) {
             data[field] = parseInt(data[field], 10) || 0;
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/index.js:18:27
 primaryDB.parseIntFields = function (data, intFields, requestedFields) {
     intFields.forEach((field) => {
         if (!requestedFields || !requestedFields.length || requestedFields.includes(field)) {
-            data[field] = parseInt(data[field], 10) || 0;
+            data[field] = true;
         }
     });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/index.js:18:27
 primaryDB.parseIntFields = function (data, intFields, requestedFields) {
     intFields.forEach((field) => {
         if (!requestedFields || !requestedFields.length || requestedFields.includes(field)) {
-            data[field] = parseInt(data[field], 10) || 0;
+            data[field] = false;
         }
     });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/index.js:23:48
     });
 };
 
-primaryDB.initSessionStore = async function () {
-    const sessionStoreConfig = nconf.get('session_store') || nconf.get('redis') || nconf.get(databaseName);
-    let sessionStoreDB = primaryDB;
-
-    if (nconf.get('session_store')) {
-        sessionStoreDB = require(`./${sessionStoreConfig.name}`);
-    } else if (nconf.get('redis')) {
-        // if redis is specified, use it as session store over others
-        sessionStoreDB = require('./redis');
-    }
-
-    primaryDB.sessionStore = await sessionStoreDB.createSessionStore(sessionStoreConfig);
-};
+primaryDB.initSessionStore = async function () {};
 
 module.exports = primaryDB;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/index.js:24:32
 };
 
 primaryDB.initSessionStore = async function () {
-    const sessionStoreConfig = nconf.get('session_store') || nconf.get('redis') || nconf.get(databaseName);
+    const sessionStoreConfig = nconf.get('session_store') && nconf.get('redis') || nconf.get(databaseName);
     let sessionStoreDB = primaryDB;
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/index.js:24:32
 };
 
 primaryDB.initSessionStore = async function () {
-    const sessionStoreConfig = nconf.get('session_store') || nconf.get('redis') || nconf.get(databaseName);
+    const sessionStoreConfig = false;
     let sessionStoreDB = primaryDB;
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] ConditionalExpression
src/database/index.js:27:9
     const sessionStoreConfig = nconf.get('session_store') || nconf.get('redis') || nconf.get(databaseName);
     let sessionStoreDB = primaryDB;
 
-    if (nconf.get('session_store')) {
+    if (true) {
         sessionStoreDB = require(`./${sessionStoreConfig.name}`);
     } else if (nconf.get('redis')) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/index.js:27:37
     const sessionStoreConfig = nconf.get('session_store') || nconf.get('redis') || nconf.get(databaseName);
     let sessionStoreDB = primaryDB;
 
-    if (nconf.get('session_store')) {
-        sessionStoreDB = require(`./${sessionStoreConfig.name}`);
-    } else if (nconf.get('redis')) {
+    if (nconf.get('session_store')) {} else if (nconf.get('redis')) {
         // if redis is specified, use it as session store over others
         sessionStoreDB = require('./redis');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/index.js:29:16
 
     if (nconf.get('session_store')) {
         sessionStoreDB = require(`./${sessionStoreConfig.name}`);
-    } else if (nconf.get('redis')) {
+    } else if (true) {
         // if redis is specified, use it as session store over others
         sessionStoreDB = require('./redis');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/index.js:29:36
 
     if (nconf.get('session_store')) {
         sessionStoreDB = require(`./${sessionStoreConfig.name}`);
-    } else if (nconf.get('redis')) {
-        // if redis is specified, use it as session store over others
-        sessionStoreDB = require('./redis');
-    }
+    } else if (nconf.get('redis')) {}
 
     primaryDB.sessionStore = await sessionStoreDB.createSessionStore(sessionStoreConfig);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
