[Killed] BlockStatement
src/database/mongo.js:17:30
 
 const mongoModule = module.exports;
 
-function isUriNotSpecified() {
-    return !prompt.history('mongo:uri').value;
-}
+function isUriNotSpecified() {}
 
 mongoModule.questions = [
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/mongo.js:18:12
 const mongoModule = module.exports;
 
 function isUriNotSpecified() {
-    return !prompt.history('mongo:uri').value;
+    return prompt.history('mongo:uri').value;
 }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:25:18
     {
         name: 'mongo:uri',
-        default: nconf.get('mongo:uri') || '',
+        default: false,
         hideOnWebInstall: true,
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:25:18
     {
         name: 'mongo:uri',
-        default: nconf.get('mongo:uri') || '',
+        default: true,
         hideOnWebInstall: true,
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/mongo.js:26:27
         name: 'mongo:uri',
         default: nconf.get('mongo:uri') || '',
-        hideOnWebInstall: true,
+        hideOnWebInstall: false,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/mongo.js:29:15
         hideOnWebInstall: true,
     },
     {
-        name: 'mongo:host',
+        name: "",
         description: 'Host IP or address of your MongoDB instance',
         default: nconf.get('mongo:host') || '127.0.0.1',
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:31:18
     {
         name: 'mongo:host',
         description: 'Host IP or address of your MongoDB instance',
-        default: nconf.get('mongo:host') || '127.0.0.1',
+        default: true,
         ask: isUriNotSpecified,
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:31:18
     {
         name: 'mongo:host',
         description: 'Host IP or address of your MongoDB instance',
-        default: nconf.get('mongo:host') || '127.0.0.1',
+        default: false,
         ask: isUriNotSpecified,
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/database/mongo.js:34:5
         default: nconf.get('mongo:host') || '127.0.0.1',
         ask: isUriNotSpecified,
     },
-    {
-        name: 'mongo:port',
-        description: 'Host port of your MongoDB instance',
-        default: nconf.get('mongo:port') || 27017,
-        ask: isUriNotSpecified,
-    },
+    {},
     {
         name: 'mongo:username',
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/mongo.js:36:22
     },
     {
         name: 'mongo:port',
-        description: 'Host port of your MongoDB instance',
+        description: "",
         default: nconf.get('mongo:port') || 27017,
         ask: isUriNotSpecified,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:37:18
     {
         name: 'mongo:port',
         description: 'Host port of your MongoDB instance',
-        default: nconf.get('mongo:port') || 27017,
+        default: false,
         ask: isUriNotSpecified,
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:37:18
     {
         name: 'mongo:port',
         description: 'Host port of your MongoDB instance',
-        default: nconf.get('mongo:port') || 27017,
+        default: true,
         ask: isUriNotSpecified,
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/database/mongo.js:40:5
         default: nconf.get('mongo:port') || 27017,
         ask: isUriNotSpecified,
     },
-    {
-        name: 'mongo:username',
-        description: 'MongoDB username',
-        default: nconf.get('mongo:username') || '',
-        ask: isUriNotSpecified,
-    },
+    {},
     {
         name: 'mongo:password',
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/mongo.js:41:15
         ask: isUriNotSpecified,
     },
     {
-        name: 'mongo:username',
+        name: "",
         description: 'MongoDB username',
         default: nconf.get('mongo:username') || '',
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:43:18
     {
         name: 'mongo:username',
         description: 'MongoDB username',
-        default: nconf.get('mongo:username') || '',
+        default: false,
         ask: isUriNotSpecified,
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:43:18
     {
         name: 'mongo:username',
         description: 'MongoDB username',
-        default: nconf.get('mongo:username') || '',
+        default: true,
         ask: isUriNotSpecified,
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:49:18
     {
         name: 'mongo:password',
         description: 'Password of your MongoDB database',
-        default: nconf.get('mongo:password') || '',
+        default: true,
         hidden: true,
         ask: isUriNotSpecified,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/mongo.js:49:18
     {
         name: 'mongo:password',
         description: 'Password of your MongoDB database',
-        default: nconf.get('mongo:password') || '',
+        default: nconf.get('mongo:password') && '',
         hidden: true,
         ask: isUriNotSpecified,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/mongo.js:50:17
         name: 'mongo:password',
         description: 'Password of your MongoDB database',
         default: nconf.get('mongo:password') || '',
-        hidden: true,
+        hidden: false,
         ask: isUriNotSpecified,
         before: function (value) { value = value || nconf.get('mongo:password') || ''; return value; },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/mongo.js:52:44
         default: nconf.get('mongo:password') || '',
         hidden: true,
         ask: isUriNotSpecified,
-        before: function (value) { value = value || nconf.get('mongo:password') || ''; return value; },
+        before: function (value) { value = value && nconf.get('mongo:password') || ''; return value; },
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/mongo.js:52:44
         default: nconf.get('mongo:password') || '',
         hidden: true,
         ask: isUriNotSpecified,
-        before: function (value) { value = value || nconf.get('mongo:password') || ''; return value; },
+        before: function (value) { value = (value || nconf.get('mongo:password')) && ''; return value; },
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:57:18
     {
         name: 'mongo:database',
         description: 'MongoDB database name',
-        default: nconf.get('mongo:database') || 'nodebb',
+        default: false,
         ask: isUriNotSpecified,
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/mongo.js:57:18
     {
         name: 'mongo:database',
         description: 'MongoDB database name',
-        default: nconf.get('mongo:database') || 'nodebb',
+        default: nconf.get('mongo:database') && 'nodebb',
         ask: isUriNotSpecified,
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/mongo.js:62:38
     },
 ];
 
-mongoModule.init = async function () {
-    client = await connection.connect(nconf.get('mongo'));
-    mongoModule.client = client.db();
-};
+mongoModule.init = async function () {};
 
 mongoModule.createSessionStore = async function (options) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/mongo.js:63:49
 ];
 
 mongoModule.init = async function () {
-    client = await connection.connect(nconf.get('mongo'));
+    client = await connection.connect(nconf.get(""));
     mongoModule.client = client.db();
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] BlockStatement
src/database/mongo.js:67:59
     mongoModule.client = client.db();
 };
 
-mongoModule.createSessionStore = async function (options) {
-    const MongoStore = require('connect-mongo');
-    const meta = require('../meta');
-
-    const store = MongoStore.create({
-        clientPromise: connection.connect(options),
-        ttl: meta.getSessionTTLSeconds(),
-    });
-
-    return store;
-};
+mongoModule.createSessionStore = async function (options) {};
 
 mongoModule.createIndices = async function () {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/mongo.js:79:47
     return store;
 };
 
-mongoModule.createIndices = async function () {
-    if (!mongoModule.client) {
-        winston.warn('[database/createIndices] database not initialized');
-        return;
-    }
-
-    winston.info('[database] Checking database indices.');
-    const collection = mongoModule.client.collection('objects');
-    await collection.createIndex({ _key: 1, score: -1 }, { background: true });
-    await collection.createIndex({ _key: 1, value: -1 }, { background: true, unique: true, sparse: true });
-    await collection.createIndex({ expireAt: 1 }, { expireAfterSeconds: 0, background: true });
-    winston.info('[database] Checking database indices done!');
-};
+mongoModule.createIndices = async function () {};
 
 mongoModule.checkCompatibility = function (callback) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/mongo.js:80:30
 };
 
 mongoModule.createIndices = async function () {
-    if (!mongoModule.client) {
-        winston.warn('[database/createIndices] database not initialized');
-        return;
-    }
+    if (!mongoModule.client) {}
 
     winston.info('[database] Checking database indices.');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] BooleanLiteral
src/database/mongo.js:80:9
 };
 
 mongoModule.createIndices = async function () {
-    if (!mongoModule.client) {
+    if (mongoModule.client) {
         winston.warn('[database/createIndices] database not initialized');
         return;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] UnaryOperator
src/database/mongo.js:87:52
 
     winston.info('[database] Checking database indices.');
     const collection = mongoModule.client.collection('objects');
-    await collection.createIndex({ _key: 1, score: -1 }, { background: true });
+    await collection.createIndex({ _key: 1, score: +1 }, { background: true });
     await collection.createIndex({ _key: 1, value: -1 }, { background: true, unique: true, sparse: true });
     await collection.createIndex({ expireAt: 1 }, { expireAfterSeconds: 0, background: true });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/mongo.js:87:72
 
     winston.info('[database] Checking database indices.');
     const collection = mongoModule.client.collection('objects');
-    await collection.createIndex({ _key: 1, score: -1 }, { background: true });
+    await collection.createIndex({ _key: 1, score: -1 }, { background: false });
     await collection.createIndex({ _key: 1, value: -1 }, { background: true, unique: true, sparse: true });
     await collection.createIndex({ expireAt: 1 }, { expireAfterSeconds: 0, background: true });
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/mongo.js:88:100
     winston.info('[database] Checking database indices.');
     const collection = mongoModule.client.collection('objects');
     await collection.createIndex({ _key: 1, score: -1 }, { background: true });
-    await collection.createIndex({ _key: 1, value: -1 }, { background: true, unique: true, sparse: true });
+    await collection.createIndex({ _key: 1, value: -1 }, { background: true, unique: true, sparse: false });
     await collection.createIndex({ expireAt: 1 }, { expireAfterSeconds: 0, background: true });
     winston.info('[database] Checking database indices done!');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] UnaryOperator
src/database/mongo.js:88:52
     winston.info('[database] Checking database indices.');
     const collection = mongoModule.client.collection('objects');
     await collection.createIndex({ _key: 1, score: -1 }, { background: true });
-    await collection.createIndex({ _key: 1, value: -1 }, { background: true, unique: true, sparse: true });
+    await collection.createIndex({ _key: 1, value: +1 }, { background: true, unique: true, sparse: true });
     await collection.createIndex({ expireAt: 1 }, { expireAfterSeconds: 0, background: true });
     winston.info('[database] Checking database indices done!');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/mongo.js:89:88
     const collection = mongoModule.client.collection('objects');
     await collection.createIndex({ _key: 1, score: -1 }, { background: true });
     await collection.createIndex({ _key: 1, value: -1 }, { background: true, unique: true, sparse: true });
-    await collection.createIndex({ expireAt: 1 }, { expireAfterSeconds: 0, background: true });
+    await collection.createIndex({ expireAt: 1 }, { expireAfterSeconds: 0, background: false });
     winston.info('[database] Checking database indices done!');
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/mongo.js:90:18
     await collection.createIndex({ _key: 1, score: -1 }, { background: true });
     await collection.createIndex({ _key: 1, value: -1 }, { background: true, unique: true, sparse: true });
     await collection.createIndex({ expireAt: 1 }, { expireAfterSeconds: 0, background: true });
-    winston.info('[database] Checking database indices done!');
+    winston.info("");
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/mongo.js:93:54
     winston.info('[database] Checking database indices done!');
 };
 
-mongoModule.checkCompatibility = function (callback) {
-    const mongoPkg = require('mongodb/package.json');
-    mongoModule.checkCompatibilityVersion(mongoPkg.version, callback);
-};
+mongoModule.checkCompatibility = function (callback) {};
 
 mongoModule.checkCompatibilityVersion = function (version, callback) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/mongo.js:98:70
     mongoModule.checkCompatibilityVersion(mongoPkg.version, callback);
 };
 
-mongoModule.checkCompatibilityVersion = function (version, callback) {
-    if (semver.lt(version, '2.0.0')) {
-        return callback(new Error('The `mongodb` package is out-of-date, please run `./nodebb setup` again.'));
-    }
-
-    callback();
-};
+mongoModule.checkCompatibilityVersion = function (version, callback) {};
 
 mongoModule.info = async function (db) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/mongo.js:99:38
 };
 
 mongoModule.checkCompatibilityVersion = function (version, callback) {
-    if (semver.lt(version, '2.0.0')) {
-        return callback(new Error('The `mongodb` package is out-of-date, please run `./nodebb setup` again.'));
-    }
+    if (semver.lt(version, '2.0.0')) {}
 
     callback();
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:99:9
 };
 
 mongoModule.checkCompatibilityVersion = function (version, callback) {
-    if (semver.lt(version, '2.0.0')) {
+    if (true) {
         return callback(new Error('The `mongodb` package is out-of-date, please run `./nodebb setup` again.'));
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:107:9
 };
 
 mongoModule.info = async function (db) {
-    if (!db) {
+    if (false) {
         const client = await connection.connect(nconf.get('mongo'));
         db = client.db();
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/mongo.js:107:9
 };
 
 mongoModule.info = async function (db) {
-    if (!db) {
+    if (db) {
         const client = await connection.connect(nconf.get('mongo'));
         db = client.db();
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:111:26
         const client = await connection.connect(nconf.get('mongo'));
         db = client.db();
     }
-    mongoModule.client = mongoModule.client || db;
+    mongoModule.client = true;
     let serverStatusError = '';
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:111:26
         const client = await connection.connect(nconf.get('mongo'));
         db = client.db();
     }
-    mongoModule.client = mongoModule.client || db;
+    mongoModule.client = false;
     let serverStatusError = '';
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/mongo.js:114:38
     mongoModule.client = mongoModule.client || db;
     let serverStatusError = '';
 
-    async function getServerStatus() {
-        try {
-            return await db.command({ serverStatus: 1 });
-        } catch (err) {
-            serverStatusError = err.message;
-            // Override mongo error with more human-readable error
-            if (err.name === 'MongoError' && err.codeName === 'Unauthorized') {
-                serverStatusError = '[[admin/advanced/database:mongo.unauthorized]]';
-            }
-            winston.error(err.stack);
-        }
-    }
+    async function getServerStatus() {}
 
     let [serverStatus, stats, listCollections] = await Promise.all([
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/mongo.js:115:13
     let serverStatusError = '';
 
     async function getServerStatus() {
-        try {
-            return await db.command({ serverStatus: 1 });
-        } catch (err) {
+        try {} catch (err) {
             serverStatusError = err.message;
             // Override mongo error with more human-readable error
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/mongo.js:117:23
     async function getServerStatus() {
         try {
             return await db.command({ serverStatus: 1 });
-        } catch (err) {
-            serverStatusError = err.message;
-            // Override mongo error with more human-readable error
-            if (err.name === 'MongoError' && err.codeName === 'Unauthorized') {
-                serverStatusError = '[[admin/advanced/database:mongo.unauthorized]]';
-            }
-            winston.error(err.stack);
-        }
+        } catch (err) {}
     }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] EqualityOperator
src/database/mongo.js:120:46
         } catch (err) {
             serverStatusError = err.message;
             // Override mongo error with more human-readable error
-            if (err.name === 'MongoError' && err.codeName === 'Unauthorized') {
+            if (err.name === 'MongoError' && err.codeName !== 'Unauthorized') {
                 serverStatusError = '[[admin/advanced/database:mongo.unauthorized]]';
             }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/mongo.js:120:17
         } catch (err) {
             serverStatusError = err.message;
             // Override mongo error with more human-readable error
-            if (err.name === 'MongoError' && err.codeName === 'Unauthorized') {
+            if (err.name === 'MongoError' || err.codeName === 'Unauthorized') {
                 serverStatusError = '[[admin/advanced/database:mongo.unauthorized]]';
             }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/mongo.js:121:37
             serverStatusError = err.message;
             // Override mongo error with more human-readable error
             if (err.name === 'MongoError' && err.codeName === 'Unauthorized') {
-                serverStatusError = '[[admin/advanced/database:mongo.unauthorized]]';
+                serverStatusError = "";
             }
             winston.error(err.stack);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/database/mongo.js:129:20
 
     let [serverStatus, stats, listCollections] = await Promise.all([
         getServerStatus(),
-        db.command({ dbStats: 1 }),
+        db.command({}),
         getCollectionStats(db),
     ]);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/mongo.js:132:13
         db.command({ dbStats: 1 }),
         getCollectionStats(db),
     ]);
-    stats = stats || {};
+    stats = stats && {};
     serverStatus = serverStatus || {};
     stats.serverStatusError = serverStatusError;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:132:13
         db.command({ dbStats: 1 }),
         getCollectionStats(db),
     ]);
-    stats = stats || {};
+    stats = true;
     serverStatus = serverStatus || {};
     stats.serverStatusError = serverStatusError;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:133:20
         getCollectionStats(db),
     ]);
     stats = stats || {};
-    serverStatus = serverStatus || {};
+    serverStatus = false;
     stats.serverStatusError = serverStatusError;
     const scale = 1024 * 1024 * 1024;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] LogicalOperator
src/database/mongo.js:133:20
         getCollectionStats(db),
     ]);
     stats = stats || {};
-    serverStatus = serverStatus || {};
+    serverStatus = serverStatus && {};
     stats.serverStatusError = serverStatusError;
     const scale = 1024 * 1024 * 1024;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
