[Killed] ArithmeticOperator
src/database/mongo.js:135:19
     stats = stats || {};
     serverStatus = serverStatus || {};
     stats.serverStatusError = serverStatusError;
-    const scale = 1024 * 1024 * 1024;
+    const scale = 1024 / 1024 * 1024;
 
     listCollections = listCollections.map(collectionInfo => ({
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/mongo.js:135:19
     stats = stats || {};
     serverStatus = serverStatus || {};
     stats.serverStatusError = serverStatusError;
-    const scale = 1024 * 1024 * 1024;
+    const scale = 1024 * 1024 / 1024;
 
     listCollections = listCollections.map(collectionInfo => ({
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/database/mongo.js:137:43
     stats.serverStatusError = serverStatusError;
     const scale = 1024 * 1024 * 1024;
 
-    listCollections = listCollections.map(collectionInfo => ({
-        name: collectionInfo.ns,
-        count: collectionInfo.count,
-        size: collectionInfo.size,
-        avgObjSize: collectionInfo.avgObjSize,
-        storageSize: collectionInfo.storageSize,
-        totalIndexSize: collectionInfo.totalIndexSize,
-        indexSizes: collectionInfo.indexSizes,
-    }));
+    listCollections = listCollections.map(() => undefined);
 
     stats.mem = serverStatus.mem || { resident: 0, virtual: 0, mapped: 0 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:147:17
         indexSizes: collectionInfo.indexSizes,
     }));
 
-    stats.mem = serverStatus.mem || { resident: 0, virtual: 0, mapped: 0 };
+    stats.mem = true;
     stats.mem.resident = (stats.mem.resident / 1024).toFixed(3);
     stats.mem.virtual = (stats.mem.virtual / 1024).toFixed(3);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/mongo.js:147:17
         indexSizes: collectionInfo.indexSizes,
     }));
 
-    stats.mem = serverStatus.mem || { resident: 0, virtual: 0, mapped: 0 };
+    stats.mem = serverStatus.mem && {
+  resident: 0,
+  virtual: 0,
+  mapped: 0
+};
     stats.mem.resident = (stats.mem.resident / 1024).toFixed(3);
     stats.mem.virtual = (stats.mem.virtual / 1024).toFixed(3);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/mongo.js:148:27
     }));
 
     stats.mem = serverStatus.mem || { resident: 0, virtual: 0, mapped: 0 };
-    stats.mem.resident = (stats.mem.resident / 1024).toFixed(3);
+    stats.mem.resident = (stats.mem.resident * 1024).toFixed(3);
     stats.mem.virtual = (stats.mem.virtual / 1024).toFixed(3);
     stats.mem.mapped = (stats.mem.mapped / 1024).toFixed(3);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/mongo.js:149:26
 
     stats.mem = serverStatus.mem || { resident: 0, virtual: 0, mapped: 0 };
     stats.mem.resident = (stats.mem.resident / 1024).toFixed(3);
-    stats.mem.virtual = (stats.mem.virtual / 1024).toFixed(3);
+    stats.mem.virtual = (stats.mem.virtual * 1024).toFixed(3);
     stats.mem.mapped = (stats.mem.mapped / 1024).toFixed(3);
     stats.collectionData = listCollections;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] ArithmeticOperator
src/database/mongo.js:150:25
     stats.mem = serverStatus.mem || { resident: 0, virtual: 0, mapped: 0 };
     stats.mem.resident = (stats.mem.resident / 1024).toFixed(3);
     stats.mem.virtual = (stats.mem.virtual / 1024).toFixed(3);
-    stats.mem.mapped = (stats.mem.mapped / 1024).toFixed(3);
+    stats.mem.mapped = (stats.mem.mapped * 1024).toFixed(3);
     stats.collectionData = listCollections;
     stats.network = serverStatus.network || { bytesIn: 0, bytesOut: 0, numRequests: 0 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:152:21
     stats.mem.virtual = (stats.mem.virtual / 1024).toFixed(3);
     stats.mem.mapped = (stats.mem.mapped / 1024).toFixed(3);
     stats.collectionData = listCollections;
-    stats.network = serverStatus.network || { bytesIn: 0, bytesOut: 0, numRequests: 0 };
+    stats.network = false;
     stats.network.bytesIn = (stats.network.bytesIn / scale).toFixed(3);
     stats.network.bytesOut = (stats.network.bytesOut / scale).toFixed(3);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/mongo.js:152:21
     stats.mem.virtual = (stats.mem.virtual / 1024).toFixed(3);
     stats.mem.mapped = (stats.mem.mapped / 1024).toFixed(3);
     stats.collectionData = listCollections;
-    stats.network = serverStatus.network || { bytesIn: 0, bytesOut: 0, numRequests: 0 };
+    stats.network = serverStatus.network && {
+  bytesIn: 0,
+  bytesOut: 0,
+  numRequests: 0
+};
     stats.network.bytesIn = (stats.network.bytesIn / scale).toFixed(3);
     stats.network.bytesOut = (stats.network.bytesOut / scale).toFixed(3);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/mongo.js:153:30
     stats.mem.mapped = (stats.mem.mapped / 1024).toFixed(3);
     stats.collectionData = listCollections;
     stats.network = serverStatus.network || { bytesIn: 0, bytesOut: 0, numRequests: 0 };
-    stats.network.bytesIn = (stats.network.bytesIn / scale).toFixed(3);
+    stats.network.bytesIn = (stats.network.bytesIn * scale).toFixed(3);
     stats.network.bytesOut = (stats.network.bytesOut / scale).toFixed(3);
     stats.network.numRequests = utils.addCommas(stats.network.numRequests);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/mongo.js:154:31
     stats.collectionData = listCollections;
     stats.network = serverStatus.network || { bytesIn: 0, bytesOut: 0, numRequests: 0 };
     stats.network.bytesIn = (stats.network.bytesIn / scale).toFixed(3);
-    stats.network.bytesOut = (stats.network.bytesOut / scale).toFixed(3);
+    stats.network.bytesOut = (stats.network.bytesOut * scale).toFixed(3);
     stats.network.numRequests = utils.addCommas(stats.network.numRequests);
     stats.raw = JSON.stringify(stats, null, 4);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/mongo.js:159:23
     stats.raw = JSON.stringify(stats, null, 4);
 
     stats.avgObjSize = stats.avgObjSize.toFixed(2);
-    stats.dataSize = (stats.dataSize / scale).toFixed(3);
+    stats.dataSize = (stats.dataSize * scale).toFixed(3);
     stats.storageSize = (stats.storageSize / scale).toFixed(3);
     stats.fileSize = stats.fileSize ? (stats.fileSize / scale).toFixed(3) : 0;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/mongo.js:160:26
 
     stats.avgObjSize = stats.avgObjSize.toFixed(2);
     stats.dataSize = (stats.dataSize / scale).toFixed(3);
-    stats.storageSize = (stats.storageSize / scale).toFixed(3);
+    stats.storageSize = (stats.storageSize * scale).toFixed(3);
     stats.fileSize = stats.fileSize ? (stats.fileSize / scale).toFixed(3) : 0;
     stats.indexSize = (stats.indexSize / scale).toFixed(3);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/mongo.js:161:40
     stats.avgObjSize = stats.avgObjSize.toFixed(2);
     stats.dataSize = (stats.dataSize / scale).toFixed(3);
     stats.storageSize = (stats.storageSize / scale).toFixed(3);
-    stats.fileSize = stats.fileSize ? (stats.fileSize / scale).toFixed(3) : 0;
+    stats.fileSize = stats.fileSize ? (stats.fileSize * scale).toFixed(3) : 0;
     stats.indexSize = (stats.indexSize / scale).toFixed(3);
     stats.storageEngine = serverStatus.storageEngine ? serverStatus.storageEngine.name : 'mmapv1';
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/mongo.js:162:24
     stats.dataSize = (stats.dataSize / scale).toFixed(3);
     stats.storageSize = (stats.storageSize / scale).toFixed(3);
     stats.fileSize = stats.fileSize ? (stats.fileSize / scale).toFixed(3) : 0;
-    stats.indexSize = (stats.indexSize / scale).toFixed(3);
+    stats.indexSize = (stats.indexSize * scale).toFixed(3);
     stats.storageEngine = serverStatus.storageEngine ? serverStatus.storageEngine.name : 'mmapv1';
     stats.host = serverStatus.host;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/mongo.js:163:90
     stats.storageSize = (stats.storageSize / scale).toFixed(3);
     stats.fileSize = stats.fileSize ? (stats.fileSize / scale).toFixed(3) : 0;
     stats.indexSize = (stats.indexSize / scale).toFixed(3);
-    stats.storageEngine = serverStatus.storageEngine ? serverStatus.storageEngine.name : 'mmapv1';
+    stats.storageEngine = serverStatus.storageEngine ? serverStatus.storageEngine.name : "";
     stats.host = serverStatus.host;
     stats.version = serverStatus.version;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/mongo.js:167:19
     stats.host = serverStatus.host;
     stats.version = serverStatus.version;
     stats.uptime = serverStatus.uptime;
-    stats.mongo = true;
+    stats.mongo = false;
     return stats;
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/mongo.js:171:39
     return stats;
 };
 
-async function getCollectionStats(db) {
-    const items = await db.listCollections().toArray();
-    return await Promise.all(items.map(collection => db.collection(collection.name).stats()));
-}
+async function getCollectionStats(db) {}
 
 mongoModule.close = function (callback) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/database/mongo.js:173:40
 
 async function getCollectionStats(db) {
     const items = await db.listCollections().toArray();
-    return await Promise.all(items.map(collection => db.collection(collection.name).stats()));
+    return await Promise.all(items.map(() => undefined));
 }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/mongo.js:176:41
     return await Promise.all(items.map(collection => db.collection(collection.name).stats()));
 }
 
-mongoModule.close = function (callback) {
-    callback = callback || function () {};
-    client.close(err => callback(err));
-};
+mongoModule.close = function (callback) {};
 
 require('./mongo/main')(mongoModule);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/mongo.js:177:16
 }
 
 mongoModule.close = function (callback) {
-    callback = callback || function () {};
+    callback = false;
     client.close(err => callback(err));
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/mongo.js:177:16
 }
 
 mongoModule.close = function (callback) {
-    callback = callback || function () {};
+    callback = callback && function () {};
     client.close(err => callback(err));
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrowFunction
src/database/mongo.js:178:18
 
 mongoModule.close = function (callback) {
     callback = callback || function () {};
-    client.close(err => callback(err));
+    client.close(() => undefined);
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/database/mongo.js:188:38
 require('./mongo/list')(mongoModule);
 require('./mongo/transaction')(mongoModule);
 
-require('../promisify')(mongoModule, ['client', 'sessionStore']);
+require('../promisify')(mongoModule, []);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
