[Killed] StringLiteral
src/database/postgres.js:15:15
 
 postgresModule.questions = [
     {
-        name: 'postgres:host',
+        name: "",
         description: 'Host IP or address of your PostgreSQL instance',
         default: nconf.get('postgres:host') || '127.0.0.1',
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:16:22
 postgresModule.questions = [
     {
         name: 'postgres:host',
-        description: 'Host IP or address of your PostgreSQL instance',
+        description: "",
         default: nconf.get('postgres:host') || '127.0.0.1',
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:17:18
     {
         name: 'postgres:host',
         description: 'Host IP or address of your PostgreSQL instance',
-        default: nconf.get('postgres:host') || '127.0.0.1',
+        default: false,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:17:18
     {
         name: 'postgres:host',
         description: 'Host IP or address of your PostgreSQL instance',
-        default: nconf.get('postgres:host') || '127.0.0.1',
+        default: true,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:20:15
         default: nconf.get('postgres:host') || '127.0.0.1',
     },
     {
-        name: 'postgres:port',
+        name: "",
         description: 'Host port of your PostgreSQL instance',
         default: nconf.get('postgres:port') || 5432,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:22:18
     {
         name: 'postgres:port',
         description: 'Host port of your PostgreSQL instance',
-        default: nconf.get('postgres:port') || 5432,
+        default: true,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/postgres.js:22:18
     {
         name: 'postgres:port',
         description: 'Host port of your PostgreSQL instance',
-        default: nconf.get('postgres:port') || 5432,
+        default: nconf.get('postgres:port') && 5432,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:26:22
     },
     {
         name: 'postgres:username',
-        description: 'PostgreSQL username',
+        description: "",
         default: nconf.get('postgres:username') || '',
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:27:18
     {
         name: 'postgres:username',
         description: 'PostgreSQL username',
-        default: nconf.get('postgres:username') || '',
+        default: true,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/postgres.js:27:18
     {
         name: 'postgres:username',
         description: 'PostgreSQL username',
-        default: nconf.get('postgres:username') || '',
+        default: nconf.get('postgres:username') && '',
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/database/postgres.js:29:5
         description: 'PostgreSQL username',
         default: nconf.get('postgres:username') || '',
     },
-    {
-        name: 'postgres:password',
-        description: 'Password of your PostgreSQL database',
-        hidden: true,
-        default: nconf.get('postgres:password') || '',
-        before: function (value) { value = value || nconf.get('postgres:password') || ''; return value; },
-    },
+    {},
     {
         name: 'postgres:database',
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:30:15
         default: nconf.get('postgres:username') || '',
     },
     {
-        name: 'postgres:password',
+        name: "",
         description: 'Password of your PostgreSQL database',
         hidden: true,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/postgres.js:32:17
     {
         name: 'postgres:password',
         description: 'Password of your PostgreSQL database',
-        hidden: true,
+        hidden: false,
         default: nconf.get('postgres:password') || '',
         before: function (value) { value = value || nconf.get('postgres:password') || ''; return value; },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/postgres.js:33:18
         name: 'postgres:password',
         description: 'Password of your PostgreSQL database',
         hidden: true,
-        default: nconf.get('postgres:password') || '',
+        default: nconf.get('postgres:password') && '',
         before: function (value) { value = value || nconf.get('postgres:password') || ''; return value; },
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:33:18
         name: 'postgres:password',
         description: 'Password of your PostgreSQL database',
         hidden: true,
-        default: nconf.get('postgres:password') || '',
+        default: true,
         before: function (value) { value = value || nconf.get('postgres:password') || ''; return value; },
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:34:44
         description: 'Password of your PostgreSQL database',
         hidden: true,
         default: nconf.get('postgres:password') || '',
-        before: function (value) { value = value || nconf.get('postgres:password') || ''; return value; },
+        before: function (value) { value = true; return value; },
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/postgres.js:34:44
         description: 'Password of your PostgreSQL database',
         hidden: true,
         default: nconf.get('postgres:password') || '',
-        before: function (value) { value = value || nconf.get('postgres:password') || ''; return value; },
+        before: function (value) { value = (value || nconf.get('postgres:password')) && ''; return value; },
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/database/postgres.js:36:5
         default: nconf.get('postgres:password') || '',
         before: function (value) { value = value || nconf.get('postgres:password') || ''; return value; },
     },
-    {
-        name: 'postgres:database',
-        description: 'PostgreSQL database name',
-        default: nconf.get('postgres:database') || 'nodebb',
-    },
+    {},
     {
         name: 'postgres:ssl',
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:39:18
     {
         name: 'postgres:database',
         description: 'PostgreSQL database name',
-        default: nconf.get('postgres:database') || 'nodebb',
+        default: false,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:39:18
     {
         name: 'postgres:database',
         description: 'PostgreSQL database name',
-        default: nconf.get('postgres:database') || 'nodebb',
+        default: true,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/database/postgres.js:41:5
         description: 'PostgreSQL database name',
         default: nconf.get('postgres:database') || 'nodebb',
     },
-    {
-        name: 'postgres:ssl',
-        description: 'Enable SSL for PostgreSQL database access',
-        default: nconf.get('postgres:ssl') || false,
-    },
+    {},
 ];
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:42:15
         default: nconf.get('postgres:database') || 'nodebb',
     },
     {
-        name: 'postgres:ssl',
+        name: "",
         description: 'Enable SSL for PostgreSQL database access',
         default: nconf.get('postgres:ssl') || false,
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:44:18
     {
         name: 'postgres:ssl',
         description: 'Enable SSL for PostgreSQL database access',
-        default: nconf.get('postgres:ssl') || false,
+        default: true,
     },
 ];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:44:18
     {
         name: 'postgres:ssl',
         description: 'Enable SSL for PostgreSQL database access',
-        default: nconf.get('postgres:ssl') || false,
+        default: false,
     },
 ];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:48:41
     },
 ];
 
-postgresModule.init = async function () {
-    const { Pool } = require('pg');
-    const connOptions = connection.getConnectionOptions();
-    const pool = new Pool(connOptions);
-    postgresModule.pool = pool;
-    postgresModule.client = pool;
-    const client = await pool.connect();
-    try {
-        await checkUpgrade(client);
-    } catch (err) {
-        winston.error(`NodeBB could not connect to your PostgreSQL database. PostgreSQL returned the following error: ${err.message}`);
-        throw err;
-    } finally {
-        client.release();
-    }
-};
+postgresModule.init = async function () {};
 
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:55:9
     postgresModule.pool = pool;
     postgresModule.client = pool;
     const client = await pool.connect();
-    try {
-        await checkUpgrade(client);
-    } catch (err) {
+    try {} catch (err) {
         winston.error(`NodeBB could not connect to your PostgreSQL database. PostgreSQL returned the following error: ${err.message}`);
         throw err;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:57:19
     const client = await pool.connect();
     try {
         await checkUpgrade(client);
-    } catch (err) {
-        winston.error(`NodeBB could not connect to your PostgreSQL database. PostgreSQL returned the following error: ${err.message}`);
-        throw err;
-    } finally {
+    } catch (err) {} finally {
         client.release();
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:60:15
     } catch (err) {
         winston.error(`NodeBB could not connect to your PostgreSQL database. PostgreSQL returned the following error: ${err.message}`);
         throw err;
-    } finally {
-        client.release();
-    }
+    } finally {}
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] StringLiteral
src/database/postgres.js:67:36
 
 
 async function checkUpgrade(client) {
-    const res = await client.query(`
-SELECT EXISTS(SELECT *
-                FROM "information_schema"."columns"
-               WHERE "table_schema" = 'public'
-                 AND "table_name" = 'objects'
-                 AND "column_name" = 'data') a,
-       EXISTS(SELECT *
-                FROM "information_schema"."columns"
-               WHERE "table_schema" = 'public'
-                 AND "table_name" = 'legacy_hash'
-                 AND "column_name" = '_key') b,
-       EXISTS(SELECT *
-                FROM "information_schema"."routines"
-               WHERE "routine_schema" = 'public'
-                 AND "routine_name" = 'nodebb_get_sorted_set_members') c`);
+    const res = await client.query(``);
 
     if (res.rows[0].a && res.rows[0].b && res.rows[0].c) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:83:9
                WHERE "routine_schema" = 'public'
                  AND "routine_name" = 'nodebb_get_sorted_set_members') c`);
 
-    if (res.rows[0].a && res.rows[0].b && res.rows[0].c) {
+    if (false) {
         return;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:83:9
                WHERE "routine_schema" = 'public'
                  AND "routine_name" = 'nodebb_get_sorted_set_members') c`);
 
-    if (res.rows[0].a && res.rows[0].b && res.rows[0].c) {
+    if (true) {
         return;
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] StringLiteral
src/database/postgres.js:87:24
         return;
     }
 
-    await client.query(`BEGIN`);
+    await client.query(``);
     try {
         if (!res.rows[0].b) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/postgres.js:89:13
 
     await client.query(`BEGIN`);
     try {
-        if (!res.rows[0].b) {
+        if (res.rows[0].b) {
             await client.query(`
 CREATE TYPE LEGACY_OBJECT_TYPE AS ENUM (
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] ConditionalExpression
src/database/postgres.js:89:13
 
     await client.query(`BEGIN`);
     try {
-        if (!res.rows[0].b) {
+        if (true) {
             await client.query(`
 CREATE TYPE LEGACY_OBJECT_TYPE AS ENUM (
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:102:32
     "expireAt" TIMESTAMPTZ DEFAULT NULL,
     UNIQUE ( "_key", "type" )
 )`);
-            await client.query(`
-CREATE TABLE "legacy_hash" (
-    "_key" TEXT NOT NULL
-        PRIMARY KEY,
-    "data" JSONB NOT NULL,
-    "type" LEGACY_OBJECT_TYPE NOT NULL
-        DEFAULT 'hash'::LEGACY_OBJECT_TYPE
-        CHECK ( "type" = 'hash' ),
-    CONSTRAINT "fk__legacy_hash__key"
-        FOREIGN KEY ("_key", "type")
-        REFERENCES "legacy_object"("_key", "type")
-        ON UPDATE CASCADE
-        ON DELETE CASCADE
-)`);
+            await client.query(``);
             await client.query(`
 CREATE TABLE "legacy_zset" (
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:116:32
         ON UPDATE CASCADE
         ON DELETE CASCADE
 )`);
-            await client.query(`
-CREATE TABLE "legacy_zset" (
-    "_key" TEXT NOT NULL,
-    "value" TEXT NOT NULL,
-    "score" NUMERIC NOT NULL,
-    "type" LEGACY_OBJECT_TYPE NOT NULL
-        DEFAULT 'zset'::LEGACY_OBJECT_TYPE
-        CHECK ( "type" = 'zset' ),
-    PRIMARY KEY ("_key", "value"),
-    CONSTRAINT "fk__legacy_zset__key"
-        FOREIGN KEY ("_key", "type")
-        REFERENCES "legacy_object"("_key", "type")
-        ON UPDATE CASCADE
-        ON DELETE CASCADE
-)`);
+            await client.query(``);
             await client.query(`
 CREATE TABLE "legacy_set" (
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:131:32
         ON UPDATE CASCADE
         ON DELETE CASCADE
 )`);
-            await client.query(`
-CREATE TABLE "legacy_set" (
-    "_key" TEXT NOT NULL,
-    "member" TEXT NOT NULL,
-    "type" LEGACY_OBJECT_TYPE NOT NULL
-        DEFAULT 'set'::LEGACY_OBJECT_TYPE
-        CHECK ( "type" = 'set' ),
-    PRIMARY KEY ("_key", "member"),
-    CONSTRAINT "fk__legacy_set__key"
-        FOREIGN KEY ("_key", "type")
-        REFERENCES "legacy_object"("_key", "type")
-        ON UPDATE CASCADE
-        ON DELETE CASCADE
-)`);
+            await client.query(``);
             await client.query(`
 CREATE TABLE "legacy_list" (
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:174:17
         ON DELETE CASCADE
 )`);
 
-            if (res.rows[0].a) {
+            if (true) {
                 await client.query(`
 INSERT INTO "legacy_object" ("_key", "type", "expireAt")
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:174:17
         ON DELETE CASCADE
 )`);
 
-            if (res.rows[0].a) {
+            if (false) {
                 await client.query(`
 INSERT INTO "legacy_object" ("_key", "type", "expireAt")
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:238:36
  WHERE (SELECT COUNT(*)
           FROM jsonb_object_keys("data" - 'expireAt')) = 2
    AND ("data" ? 'members')`);
-                await client.query(`
-INSERT INTO "legacy_list" ("_key", "array")
-SELECT "data"->>'_key',
-       ARRAY(SELECT t
-               FROM jsonb_array_elements_text("data"->'list') WITH ORDINALITY l(t, i)
-              ORDER BY i ASC)
-  FROM "objects"
- WHERE (SELECT COUNT(*)
-          FROM jsonb_object_keys("data" - 'expireAt')) = 2
-   AND ("data" ? 'array')`);
+                await client.query(``);
                 await client.query(`
 INSERT INTO "legacy_string" ("_key", "data")
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/postgres.js:271:13
     OR "expireAt" > CURRENT_TIMESTAMP`);
         }
 
-        if (!res.rows[0].c) {
+        if (res.rows[0].c) {
             await client.query(`
 CREATE FUNCTION "nodebb_get_sorted_set_members"(TEXT) RETURNS TEXT[] AS $$
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:271:29
     OR "expireAt" > CURRENT_TIMESTAMP`);
         }
 
-        if (!res.rows[0].c) {
-            await client.query(`
-CREATE FUNCTION "nodebb_get_sorted_set_members"(TEXT) RETURNS TEXT[] AS $$
-    SELECT array_agg(z."value" ORDER BY z."score" ASC)
-      FROM "legacy_object_live" o
-     INNER JOIN "legacy_zset" z
-             ON o."_key" = z."_key"
-            AND o."type" = z."type"
-          WHERE o."_key" = $1
-$$ LANGUAGE sql
-STABLE
-STRICT
-PARALLEL SAFE`);
-        }
+        if (!res.rows[0].c) {}
     } catch (ex) {
         await client.query(`ROLLBACK`);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:285:18
 STRICT
 PARALLEL SAFE`);
         }
-    } catch (ex) {
-        await client.query(`ROLLBACK`);
-        throw ex;
-    }
+    } catch (ex) {}
     await client.query(`COMMIT`);
 }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:295:23
 postgresModule.createSessionStore = async function (options) {
     const meta = require('../meta');
 
-    function done(db) {
-        const sessionStore = require('connect-pg-simple')(session);
-        return new sessionStore({
-            pool: db,
-            ttl: meta.getSessionTTLSeconds(),
-            pruneSessionInterval: nconf.get('isPrimary') ? 60 : false,
-        });
-    }
+    function done(db) {}
 
     const db = await connection.connect(options);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/database/postgres.js:297:33
 
     function done(db) {
         const sessionStore = require('connect-pg-simple')(session);
-        return new sessionStore({
-            pool: db,
-            ttl: meta.getSessionTTLSeconds(),
-            pruneSessionInterval: nconf.get('isPrimary') ? 60 : false,
-        });
+        return new sessionStore({});
     }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/postgres.js:300:65
         return new sessionStore({
             pool: db,
             ttl: meta.getSessionTTLSeconds(),
-            pruneSessionInterval: nconf.get('isPrimary') ? 60 : false,
+            pruneSessionInterval: nconf.get('isPrimary') ? 60 : true,
         });
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/postgres.js:306:9
 
     const db = await connection.connect(options);
 
-    if (!nconf.get('isPrimary')) {
+    if (nconf.get('isPrimary')) {
         return done(db);
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:306:9
 
     const db = await connection.connect(options);
 
-    if (!nconf.get('isPrimary')) {
+    if (true) {
         return done(db);
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:310:20
         return done(db);
     }
 
-    await db.query(`
-CREATE TABLE IF NOT EXISTS "session" (
-    "sid" CHAR(32) NOT NULL
-        COLLATE "C"
-        PRIMARY KEY,
-    "sess" JSONB NOT NULL,
-    "expire" TIMESTAMPTZ NOT NULL
-) WITHOUT OIDS;
-
-CREATE INDEX IF NOT EXISTS "session_expire_idx" ON "session"("expire");
-
-ALTER TABLE "session"
-    ALTER "sid" SET STORAGE MAIN,
-    CLUSTER ON "session_expire_idx";`);
+    await db.query(``);
 
     return done(db);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:328:52
     return done(db);
 };
 
-postgresModule.createIndices = function (callback) {
-    if (!postgresModule.pool) {
-        winston.warn('[database/createIndices] database not initialized');
-        return callback();
-    }
-
-    const query = postgresModule.pool.query.bind(postgresModule.pool);
-
-    winston.info('[database] Checking database indices.');
-    async.series([
-        async.apply(query, `CREATE INDEX IF NOT EXISTS "idx__legacy_zset__key__score" ON "legacy_zset"("_key" ASC, "score" DESC)`),
-        async.apply(query, `CREATE INDEX IF NOT EXISTS "idx__legacy_object__expireAt" ON "legacy_object"("expireAt" ASC)`),
-    ], (err) => {
-        if (err) {
-            winston.error(`Error creating index ${err.message}`);
-            return callback(err);
-        }
-        winston.info('[database] Checking database indices done!');
-        callback();
-    });
-};
+postgresModule.createIndices = function (callback) {};
 
 postgresModule.checkCompatibility = function (callback) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/postgres.js:329:9
 };
 
 postgresModule.createIndices = function (callback) {
-    if (!postgresModule.pool) {
+    if (postgresModule.pool) {
         winston.warn('[database/createIndices] database not initialized');
         return callback();
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:329:9
 };
 
 postgresModule.createIndices = function (callback) {
-    if (!postgresModule.pool) {
+    if (false) {
         winston.warn('[database/createIndices] database not initialized');
         return callback();
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:330:22
 
 postgresModule.createIndices = function (callback) {
     if (!postgresModule.pool) {
-        winston.warn('[database/createIndices] database not initialized');
+        winston.warn("");
         return callback();
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
