[Killed] StringLiteral
src/database/postgres.js:339:28
     winston.info('[database] Checking database indices.');
     async.series([
         async.apply(query, `CREATE INDEX IF NOT EXISTS "idx__legacy_zset__key__score" ON "legacy_zset"("_key" ASC, "score" DESC)`),
-        async.apply(query, `CREATE INDEX IF NOT EXISTS "idx__legacy_object__expireAt" ON "legacy_object"("expireAt" ASC)`),
+        async.apply(query, ``),
     ], (err) => {
         if (err) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] BlockStatement
src/database/postgres.js:340:17
     async.series([
         async.apply(query, `CREATE INDEX IF NOT EXISTS "idx__legacy_zset__key__score" ON "legacy_zset"("_key" ASC, "score" DESC)`),
         async.apply(query, `CREATE INDEX IF NOT EXISTS "idx__legacy_object__expireAt" ON "legacy_object"("expireAt" ASC)`),
-    ], (err) => {
-        if (err) {
-            winston.error(`Error creating index ${err.message}`);
-            return callback(err);
-        }
-        winston.info('[database] Checking database indices done!');
-        callback();
-    });
+    ], (err) => {});
 };
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:341:13
         async.apply(query, `CREATE INDEX IF NOT EXISTS "idx__legacy_zset__key__score" ON "legacy_zset"("_key" ASC, "score" DESC)`),
         async.apply(query, `CREATE INDEX IF NOT EXISTS "idx__legacy_object__expireAt" ON "legacy_object"("expireAt" ASC)`),
     ], (err) => {
-        if (err) {
+        if (false) {
             winston.error(`Error creating index ${err.message}`);
             return callback(err);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:341:13
         async.apply(query, `CREATE INDEX IF NOT EXISTS "idx__legacy_zset__key__score" ON "legacy_zset"("_key" ASC, "score" DESC)`),
         async.apply(query, `CREATE INDEX IF NOT EXISTS "idx__legacy_object__expireAt" ON "legacy_object"("expireAt" ASC)`),
     ], (err) => {
-        if (err) {
+        if (true) {
             winston.error(`Error creating index ${err.message}`);
             return callback(err);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:342:27
         async.apply(query, `CREATE INDEX IF NOT EXISTS "idx__legacy_object__expireAt" ON "legacy_object"("expireAt" ASC)`),
     ], (err) => {
         if (err) {
-            winston.error(`Error creating index ${err.message}`);
+            winston.error(``);
             return callback(err);
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:350:57
     });
 };
 
-postgresModule.checkCompatibility = function (callback) {
-    const postgresPkg = require('pg/package.json');
-    postgresModule.checkCompatibilityVersion(postgresPkg.version, callback);
-};
+postgresModule.checkCompatibility = function (callback) {};
 
 postgresModule.checkCompatibilityVersion = function (version, callback) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:355:73
     postgresModule.checkCompatibilityVersion(postgresPkg.version, callback);
 };
 
-postgresModule.checkCompatibilityVersion = function (version, callback) {
-    if (semver.lt(version, '7.0.0')) {
-        return callback(new Error('The `pg` package is out-of-date, please run `./nodebb setup` again.'));
-    }
-
-    callback();
-};
+postgresModule.checkCompatibilityVersion = function (version, callback) {};
 
 postgresModule.info = async function (db) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:356:9
 };
 
 postgresModule.checkCompatibilityVersion = function (version, callback) {
-    if (semver.lt(version, '7.0.0')) {
+    if (true) {
         return callback(new Error('The `pg` package is out-of-date, please run `./nodebb setup` again.'));
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:356:9
 };
 
 postgresModule.checkCompatibilityVersion = function (version, callback) {
-    if (semver.lt(version, '7.0.0')) {
+    if (false) {
         return callback(new Error('The `pg` package is out-of-date, please run `./nodebb setup` again.'));
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:363:43
     callback();
 };
 
-postgresModule.info = async function (db) {
-    if (!db) {
-        db = await connection.connect(nconf.get('postgres'));
-    }
-    postgresModule.pool = postgresModule.pool || db;
-    const res = await db.query(`
-        SELECT true "postgres",
-           current_setting('server_version') "version",
-             EXTRACT(EPOCH FROM NOW() - pg_postmaster_start_time()) * 1000 "uptime"
-    `);
-    return {
-        ...res.rows[0],
-        raw: JSON.stringify(res.rows[0], null, 4),
-    };
-};
+postgresModule.info = async function (db) {};
 
 postgresModule.close = async function () {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:364:9
 };
 
 postgresModule.info = async function (db) {
-    if (!db) {
+    if (false) {
         db = await connection.connect(nconf.get('postgres'));
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/postgres.js:364:9
 };
 
 postgresModule.info = async function (db) {
-    if (!db) {
+    if (db) {
         db = await connection.connect(nconf.get('postgres'));
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/postgres.js:367:27
     if (!db) {
         db = await connection.connect(nconf.get('postgres'));
     }
-    postgresModule.pool = postgresModule.pool || db;
+    postgresModule.pool = postgresModule.pool && db;
     const res = await db.query(`
         SELECT true "postgres",
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/postgres.js:367:27
     if (!db) {
         db = await connection.connect(nconf.get('postgres'));
     }
-    postgresModule.pool = postgresModule.pool || db;
+    postgresModule.pool = false;
     const res = await db.query(`
         SELECT true "postgres",
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/postgres.js:379:42
     };
 };
 
-postgresModule.close = async function () {
-    await postgresModule.pool.end();
-};
+postgresModule.close = async function () {};
 
 require('./postgres/main')(postgresModule);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/postgres.js:390:42
 require('./postgres/list')(postgresModule);
 require('./postgres/transaction')(postgresModule);
 
-require('../promisify')(postgresModule, ['client', 'sessionStore', 'pool', 'transaction']);
+require('../promisify')(postgresModule, ["", 'sessionStore', 'pool', 'transaction']);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArrayDeclaration
src/database/postgres.js:390:41
 require('./postgres/list')(postgresModule);
 require('./postgres/transaction')(postgresModule);
 
-require('../promisify')(postgresModule, ['client', 'sessionStore', 'pool', 'transaction']);
+require('../promisify')(postgresModule, []);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
