[Killed] ConditionalExpression
src/database/redis.js:15:18
     {
         name: 'redis:host',
         description: 'Host IP or address of your Redis instance',
-        default: nconf.get('redis:host') || '127.0.0.1',
+        default: true,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:15:18
     {
         name: 'redis:host',
         description: 'Host IP or address of your Redis instance',
-        default: nconf.get('redis:host') || '127.0.0.1',
+        default: false,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:20:18
     {
         name: 'redis:port',
         description: 'Host port of your Redis instance',
-        default: nconf.get('redis:port') || 6379,
+        default: true,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:20:18
     {
         name: 'redis:port',
         description: 'Host port of your Redis instance',
-        default: nconf.get('redis:port') || 6379,
+        default: false,
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/redis.js:24:22
     },
     {
         name: 'redis:password',
-        description: 'Password of your Redis database',
+        description: "",
         hidden: true,
         default: nconf.get('redis:password') || '',
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/redis.js:25:17
     {
         name: 'redis:password',
         description: 'Password of your Redis database',
-        hidden: true,
+        hidden: false,
         default: nconf.get('redis:password') || '',
         before: function (value) { value = value || nconf.get('redis:password') || ''; return value; },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] ConditionalExpression
src/database/redis.js:26:18
         name: 'redis:password',
         description: 'Password of your Redis database',
         hidden: true,
-        default: nconf.get('redis:password') || '',
+        default: false,
         before: function (value) { value = value || nconf.get('redis:password') || ''; return value; },
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/redis.js:26:18
         name: 'redis:password',
         description: 'Password of your Redis database',
         hidden: true,
-        default: nconf.get('redis:password') || '',
+        default: nconf.get('redis:password') && '',
         before: function (value) { value = value || nconf.get('redis:password') || ''; return value; },
     },
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/redis.js:27:34
         description: 'Password of your Redis database',
         hidden: true,
         default: nconf.get('redis:password') || '',
-        before: function (value) { value = value || nconf.get('redis:password') || ''; return value; },
+        before: function (value) {},
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/redis.js:27:44
         description: 'Password of your Redis database',
         hidden: true,
         default: nconf.get('redis:password') || '',
-        before: function (value) { value = value || nconf.get('redis:password') || ''; return value; },
+        before: function (value) { value = value && nconf.get('redis:password') || ''; return value; },
     },
     {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/database/redis.js:29:5
         default: nconf.get('redis:password') || '',
         before: function (value) { value = value || nconf.get('redis:password') || ''; return value; },
     },
-    {
-        name: 'redis:database',
-        description: 'Which database to use (0..n)',
-        default: nconf.get('redis:database') || 0,
-    },
+    {},
 ];
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/redis.js:32:18
     {
         name: 'redis:database',
         description: 'Which database to use (0..n)',
-        default: nconf.get('redis:database') || 0,
+        default: nconf.get('redis:database') && 0,
     },
 ];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:32:18
     {
         name: 'redis:database',
         description: 'Which database to use (0..n)',
-        default: nconf.get('redis:database') || 0,
+        default: false,
     },
 ];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON
info: {
    "url": "http://127.0.0.1:4567",
    "secret": "894b3e58-8e28-4740-b249-7744c9845af0",

[Killed] BlockStatement
src/database/redis.js:37:38
 ];
 
 
-redisModule.init = async function () {
-    redisModule.client = await connection.connect(nconf.get('redis'));
-};
+redisModule.init = async function () {};
 
 redisModule.createSessionStore = async function (options) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/redis.js:41:59
     redisModule.client = await connection.connect(nconf.get('redis'));
 };
 
-redisModule.createSessionStore = async function (options) {
-    const meta = require('../meta');
-    const sessionStore = require('connect-redis')(session);
-    const client = await connection.connect(options);
-    const store = new sessionStore({
-        client: client,
-        ttl: meta.getSessionTTLSeconds(),
-    });
-    return store;
-};
+redisModule.createSessionStore = async function (options) {};
 
 redisModule.checkCompatibility = async function () {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ObjectLiteral
src/database/redis.js:45:36
     const meta = require('../meta');
     const sessionStore = require('connect-redis')(session);
     const client = await connection.connect(options);
-    const store = new sessionStore({
-        client: client,
-        ttl: meta.getSessionTTLSeconds(),
-    });
+    const store = new sessionStore({});
     return store;
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/redis.js:52:52
     return store;
 };
 
-redisModule.checkCompatibility = async function () {
-    const info = await redisModule.info(redisModule.client);
-    await redisModule.checkCompatibilityVersion(info.redis_version);
-};
+redisModule.checkCompatibility = async function () {};
 
 redisModule.checkCompatibilityVersion = function (version, callback) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/redis.js:57:70
     await redisModule.checkCompatibilityVersion(info.redis_version);
 };
 
-redisModule.checkCompatibilityVersion = function (version, callback) {
-    if (semver.lt(version, '2.8.9')) {
-        callback(new Error('Your Redis version is not new enough to support NodeBB, please upgrade Redis to v2.8.9 or higher.'));
-    }
-    callback();
-};
+redisModule.checkCompatibilityVersion = function (version, callback) {};
 
 redisModule.close = async function () {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/redis.js:58:38
 };
 
 redisModule.checkCompatibilityVersion = function (version, callback) {
-    if (semver.lt(version, '2.8.9')) {
-        callback(new Error('Your Redis version is not new enough to support NodeBB, please upgrade Redis to v2.8.9 or higher.'));
-    }
+    if (semver.lt(version, '2.8.9')) {}
     callback();
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:58:9
 };
 
 redisModule.checkCompatibilityVersion = function (version, callback) {
-    if (semver.lt(version, '2.8.9')) {
+    if (true) {
         callback(new Error('Your Redis version is not new enough to support NodeBB, please upgrade Redis to v2.8.9 or higher.'));
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/redis.js:64:39
     callback();
 };
 
-redisModule.close = async function () {
-    await redisModule.client.quit();
-};
+redisModule.close = async function () {};
 
 redisModule.info = async function (cxn) {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/redis.js:69:9
 };
 
 redisModule.info = async function (cxn) {
-    if (!cxn) {
+    if (cxn) {
         cxn = await connection.connect(nconf.get('redis'));
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/redis.js:69:15
 };
 
 redisModule.info = async function (cxn) {
-    if (!cxn) {
-        cxn = await connection.connect(nconf.get('redis'));
-    }
+    if (!cxn) {}
     redisModule.client = redisModule.client || cxn;
     const data = await cxn.info();
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/redis.js:70:50
 
 redisModule.info = async function (cxn) {
     if (!cxn) {
-        cxn = await connection.connect(nconf.get('redis'));
+        cxn = await connection.connect(nconf.get(""));
     }
     redisModule.client = redisModule.client || cxn;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:72:26
     if (!cxn) {
         cxn = await connection.connect(nconf.get('redis'));
     }
-    redisModule.client = redisModule.client || cxn;
+    redisModule.client = true;
     const data = await cxn.info();
     const lines = data.toString().split('\r\n').sort();
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:72:26
     if (!cxn) {
         cxn = await connection.connect(nconf.get('redis'));
     }
-    redisModule.client = redisModule.client || cxn;
+    redisModule.client = false;
     const data = await cxn.info();
     const lines = data.toString().split('\r\n').sort();
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] MethodExpression
src/database/redis.js:74:19
     }
     redisModule.client = redisModule.client || cxn;
     const data = await cxn.info();
-    const lines = data.toString().split('\r\n').sort();
+    const lines = data.toString().split('\r\n');
     const redisData = {};
     lines.forEach((line) => {
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/redis.js:76:29
     const data = await cxn.info();
     const lines = data.toString().split('\r\n').sort();
     const redisData = {};
-    lines.forEach((line) => {
-        const parts = line.split(':');
-        if (parts[1]) {
-            redisData[parts[0]] = parts[1];
-        }
-    });
+    lines.forEach((line) => {});
 
     const keyInfo = redisData[`db${nconf.get('redis:database')}`];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/redis.js:77:34
     const lines = data.toString().split('\r\n').sort();
     const redisData = {};
     lines.forEach((line) => {
-        const parts = line.split(':');
+        const parts = line.split("");
         if (parts[1]) {
             redisData[parts[0]] = parts[1];
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:78:13
     const redisData = {};
     lines.forEach((line) => {
         const parts = line.split(':');
-        if (parts[1]) {
+        if (true) {
             redisData[parts[0]] = parts[1];
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:78:13
     const redisData = {};
     lines.forEach((line) => {
         const parts = line.split(':');
-        if (parts[1]) {
+        if (false) {
             redisData[parts[0]] = parts[1];
         }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/redis.js:83:31
         }
     });
 
-    const keyInfo = redisData[`db${nconf.get('redis:database')}`];
+    const keyInfo = redisData[``];
     if (keyInfo) {
         const split = keyInfo.split(',');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:84:9
     });
 
     const keyInfo = redisData[`db${nconf.get('redis:database')}`];
-    if (keyInfo) {
+    if (true) {
         const split = keyInfo.split(',');
         redisData.keys = (split[0] || '').replace('keys=', '');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/redis.js:84:18
     });
 
     const keyInfo = redisData[`db${nconf.get('redis:database')}`];
-    if (keyInfo) {
-        const split = keyInfo.split(',');
-        redisData.keys = (split[0] || '').replace('keys=', '');
-        redisData.expires = (split[1] || '').replace('expires=', '');
-        redisData.avg_ttl = (split[2] || '').replace('avg_ttl=', '');
-    }
+    if (keyInfo) {}
 
     redisData.instantaneous_input = (redisData.instantaneous_input_kbps / 1024).toFixed(3);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/redis.js:86:27
     const keyInfo = redisData[`db${nconf.get('redis:database')}`];
     if (keyInfo) {
         const split = keyInfo.split(',');
-        redisData.keys = (split[0] || '').replace('keys=', '');
+        redisData.keys = (split[0] && '').replace('keys=', '');
         redisData.expires = (split[1] || '').replace('expires=', '');
         redisData.avg_ttl = (split[2] || '').replace('avg_ttl=', '');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:86:27
     const keyInfo = redisData[`db${nconf.get('redis:database')}`];
     if (keyInfo) {
         const split = keyInfo.split(',');
-        redisData.keys = (split[0] || '').replace('keys=', '');
+        redisData.keys = (true).replace('keys=', '');
         redisData.expires = (split[1] || '').replace('expires=', '');
         redisData.avg_ttl = (split[2] || '').replace('avg_ttl=', '');
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:87:30
     if (keyInfo) {
         const split = keyInfo.split(',');
         redisData.keys = (split[0] || '').replace('keys=', '');
-        redisData.expires = (split[1] || '').replace('expires=', '');
+        redisData.expires = (false).replace('expires=', '');
         redisData.avg_ttl = (split[2] || '').replace('avg_ttl=', '');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:87:30
     if (keyInfo) {
         const split = keyInfo.split(',');
         redisData.keys = (split[0] || '').replace('keys=', '');
-        redisData.expires = (split[1] || '').replace('expires=', '');
+        redisData.expires = (true).replace('expires=', '');
         redisData.avg_ttl = (split[2] || '').replace('avg_ttl=', '');
     }
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] LogicalOperator
src/database/redis.js:88:30
         const split = keyInfo.split(',');
         redisData.keys = (split[0] || '').replace('keys=', '');
         redisData.expires = (split[1] || '').replace('expires=', '');
-        redisData.avg_ttl = (split[2] || '').replace('avg_ttl=', '');
+        redisData.avg_ttl = (split[2] && '').replace('avg_ttl=', '');
     }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ConditionalExpression
src/database/redis.js:88:30
         const split = keyInfo.split(',');
         redisData.keys = (split[0] || '').replace('keys=', '');
         redisData.expires = (split[1] || '').replace('expires=', '');
-        redisData.avg_ttl = (split[2] || '').replace('avg_ttl=', '');
+        redisData.avg_ttl = (true).replace('avg_ttl=', '');
     }
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/redis.js:91:38
         redisData.avg_ttl = (split[2] || '').replace('avg_ttl=', '');
     }
 
-    redisData.instantaneous_input = (redisData.instantaneous_input_kbps / 1024).toFixed(3);
+    redisData.instantaneous_input = (redisData.instantaneous_input_kbps * 1024).toFixed(3);
     redisData.instantaneous_output = (redisData.instantaneous_output_kbps / 1024).toFixed(3);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/redis.js:92:39
     }
 
     redisData.instantaneous_input = (redisData.instantaneous_input_kbps / 1024).toFixed(3);
-    redisData.instantaneous_output = (redisData.instantaneous_output_kbps / 1024).toFixed(3);
+    redisData.instantaneous_output = (redisData.instantaneous_output_kbps * 1024).toFixed(3);
 
     redisData.total_net_input = (redisData.total_net_input_bytes / (1024 * 1024 * 1024)).toFixed(3);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/redis.js:94:69
     redisData.instantaneous_input = (redisData.instantaneous_input_kbps / 1024).toFixed(3);
     redisData.instantaneous_output = (redisData.instantaneous_output_kbps / 1024).toFixed(3);
 
-    redisData.total_net_input = (redisData.total_net_input_bytes / (1024 * 1024 * 1024)).toFixed(3);
+    redisData.total_net_input = (redisData.total_net_input_bytes / (1024 * 1024 / 1024)).toFixed(3);
     redisData.total_net_output = (redisData.total_net_output_bytes / (1024 * 1024 * 1024)).toFixed(3);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/redis.js:94:34
     redisData.instantaneous_input = (redisData.instantaneous_input_kbps / 1024).toFixed(3);
     redisData.instantaneous_output = (redisData.instantaneous_output_kbps / 1024).toFixed(3);
 
-    redisData.total_net_input = (redisData.total_net_input_bytes / (1024 * 1024 * 1024)).toFixed(3);
+    redisData.total_net_input = (redisData.total_net_input_bytes * (1024 * 1024 * 1024)).toFixed(3);
     redisData.total_net_output = (redisData.total_net_output_bytes / (1024 * 1024 * 1024)).toFixed(3);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/redis.js:95:35
     redisData.instantaneous_output = (redisData.instantaneous_output_kbps / 1024).toFixed(3);
 
     redisData.total_net_input = (redisData.total_net_input_bytes / (1024 * 1024 * 1024)).toFixed(3);
-    redisData.total_net_output = (redisData.total_net_output_bytes / (1024 * 1024 * 1024)).toFixed(3);
+    redisData.total_net_output = (redisData.total_net_output_bytes * (1024 * 1024 * 1024)).toFixed(3);
 
     redisData.used_memory_human = (redisData.used_memory / (1024 * 1024 * 1024)).toFixed(3);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/redis.js:95:71
     redisData.instantaneous_output = (redisData.instantaneous_output_kbps / 1024).toFixed(3);
 
     redisData.total_net_input = (redisData.total_net_input_bytes / (1024 * 1024 * 1024)).toFixed(3);
-    redisData.total_net_output = (redisData.total_net_output_bytes / (1024 * 1024 * 1024)).toFixed(3);
+    redisData.total_net_output = (redisData.total_net_output_bytes / (1024 * 1024 / 1024)).toFixed(3);
 
     redisData.used_memory_human = (redisData.used_memory / (1024 * 1024 * 1024)).toFixed(3);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/redis.js:97:61
     redisData.total_net_input = (redisData.total_net_input_bytes / (1024 * 1024 * 1024)).toFixed(3);
     redisData.total_net_output = (redisData.total_net_output_bytes / (1024 * 1024 * 1024)).toFixed(3);
 
-    redisData.used_memory_human = (redisData.used_memory / (1024 * 1024 * 1024)).toFixed(3);
+    redisData.used_memory_human = (redisData.used_memory / (1024 / 1024 * 1024)).toFixed(3);
     redisData.raw = JSON.stringify(redisData, null, 4);
     redisData.redis = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] ArithmeticOperator
src/database/redis.js:97:61
     redisData.total_net_input = (redisData.total_net_input_bytes / (1024 * 1024 * 1024)).toFixed(3);
     redisData.total_net_output = (redisData.total_net_output_bytes / (1024 * 1024 * 1024)).toFixed(3);
 
-    redisData.used_memory_human = (redisData.used_memory / (1024 * 1024 * 1024)).toFixed(3);
+    redisData.used_memory_human = (redisData.used_memory / (1024 * 1024 / 1024)).toFixed(3);
     redisData.raw = JSON.stringify(redisData, null, 4);
     redisData.redis = true;
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BooleanLiteral
src/database/redis.js:99:23
 
     redisData.used_memory_human = (redisData.used_memory / (1024 * 1024 * 1024)).toFixed(3);
     redisData.raw = JSON.stringify(redisData, null, 4);
-    redisData.redis = true;
+    redisData.redis = false;
     return redisData;
 };
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] BlockStatement
src/database/redis.js:103:47
     return redisData;
 };
 
-redisModule.socketAdapter = async function () {
-    const redisAdapter = require('@socket.io/redis-adapter');
-    const pub = await connection.connect(nconf.get('redis'));
-    const sub = await connection.connect(nconf.get('redis'));
-    return redisAdapter(pub, sub, {
-        key: `db:${nconf.get('redis:database')}:adapter_key`,
-    });
-};
+redisModule.socketAdapter = async function () {};
 
 require('./redis/main')(redisModule);
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",

[Killed] StringLiteral
src/database/redis.js:119:49
 require('./redis/list')(redisModule);
 require('./redis/transaction')(redisModule);
 
-require('../promisify')(redisModule, ['client', 'sessionStore']);
+require('../promisify')(redisModule, ['client', ""]);
 
killedBy: All tests
statusReason: > nodebb@2.8.1 test
> npx tsc && nyc --reporter=html --reporter=text-summary mocha


info: configJSON

info: {
    "url": "http://127.0.0.1:4567",
